{
  "header": {
    "aboutMe": "Über mich",
    "skillSet": "Fähigkeiten",
    "myWork": "Projekte",
    "english": "Englisch",
    "deutsch": "Deutsch"
  },

  "atf": {
    "greeting": "Hallo! Ich bin Benjamin",
    "role": "FRONTEND ENTWICKLER",
    "scroll": "SCROLLEN"
  },
  "intro": {
    "headline": "Lets Work together",
    "subHeadline": "Ich",
    "location": "wohne in Düsseldorf",
    "remote": "bin bereit für Remote-Arbeit",
    "relocate": "bin bereit für einen Umzug",
    "description": "Ich bin ein Frontend-Entwickler mit Sitz in Düsseldorf, Deutschland. Ich helfe gerne Designern und Unternehmen, ihre Ideen in die Realität umzusetzen. Ich freue mich darauf, meine Entwicklerkarriere mit einer Junior-Webentwickler-Position fortzusetzen. Meine Fähigkeit, komplexe Probleme zu lösen, und meine Leidenschaft für Programmierung machen mich zu einem wertvollen Mitglied für Ihr Team.",
    "contactText": "Wenn Sie denken, dass ich gut zu Ihren Projekten passe, kontaktieren Sie mich.",
    "button": "Nachricht senden"
  },
  "skills": {
    "headline": "Fähigkeiten"
  },
  "comments": {
    "headline": "Brauchen Sie einen Teamplayer?",
    "subHeadline": "Das sagen meine Kollegen über mich",
    "feedback": [
      {
        "name": "Peter Pfautsch",
        "project": "Projekt Join",
        "text": "Benjamin, dein strukturierter Ansatz und deine schnelle Problemlösung waren entscheidend für den Erfolg des Projekts. Vielen Dank für deine zuverlässige und präzise Arbeit!"
      },
      {
        "name": "Dennis Freyer",
        "project": "Projekt Join",
        "text": "Er ist sehr hilfsbereit und hat immer eine Lösung parat, wenn Probleme auftreten."
      }
    ]
  },
  "projects": {
    "headline": "Meine Projekte",
    "subHeadline": "Entdecken Sie eine Auswahl meiner Arbeiten hier – Interagieren Sie mit den Projekten, um meine Fähigkeiten in Aktion zu sehen.",
    "projects": [
      {
        "title": "JOIN",
        "subtitle": "JavaScript | HTML | CSS | Firebase",
        "description": "Task-Manager, inspiriert vom Kanban-System. Erstellen und organisieren Sie Aufgaben mit Drag-and-Drop-Funktionen, weisen Sie Benutzern und Kategorien zu.",
        "btngit": "Github",
        "btntest": "Projekt anzeigen"
      },
      {
        "title": "El Pollo Loco",
        "subtitle": "JavaScript | HTML | CSS",
        "description": "Jump-, Run- und Throw-Spiel auf Basis eines objektorientierten Ansatzes. Helfen Sie Pepe, Münzen und Tabasco-Salsa zu finden, um gegen das verrückte Huhn zu kämpfen.",
        "btngit": "Github",
        "btntest": "Projekt anzeigen"
      },
      {
        "title": "Pokédex",
        "subtitle": "JavaScript | HTML | CSS | API",
        "description": "Basierend auf der PokéAPI eine einfache Bibliothek, die Pokémon-Informationen bereitstellt und katalogisiert.",
        "btngit": "Github",
        "btntest": "Projekt anzeigen"
      }
    ]
  },
  "contact": {
    "headline": "Kontakt",
    "gotProblem": "Haben Sie ein Problem zu lösen?",
    "description": "Nutzen Sie gerne das Kontaktformular, um mich zu erreichen. Ich freue mich auf Ihre Nachrichten und bin mir sicher, dass wir Ihre Ideen zusammen verwirklichen können :)",
    "callToAction": "Brauchen Sie einen Frontend-Entwickler?",
    "contact": "kontaktieren Sie mich",
    "name": "Ihre Name",
    "email": "Ihre E-Mail",
    "message": "Ihre Nachricht an mich",
    "privacy": "Ich habe die <a href='/privacy-policy' target='_blank'>Datenschutzrichtlinien</a> gelesen und stimme der Verarbeitung meiner Daten wie beschrieben zu.",
    "submit": "Sag Hallo ;)",
    "successMessage": "Danke für Ihre Nachricht! Ich melde mich bald.",
    "nameError": "Geben Sie einen gültigen Namen ein (nur Buchstaben).",
    "emailError": "Geben Sie eine gültige E-Mail-Adresse ein (muss ein „@“ enthalten, bspw.: example@aol.de)",
    "messageError": "Das Nachrichtenfeld darf nicht leer sein und muss mindestens 3 Buchstaben enthalten." 
  },
    "legal": {
      "heading": "Impressum",
      "contact": "Kontakt",
      "phone": "Telefon",
      "email": "E-Mail",
      "responsibility": "Verantwortlich für den Inhalt gemäß § 55 Abs. 2 RStV",
      
      "liability_content": "Haftung für Inhalte",
      "liability_content_text": "Als Dienstanbieter bin ich gemäß § 7 Abs.1 TMG für eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich. Jedoch bin ich nach §§ 8 bis 10 TMG nicht verpflichtet, übermittelte oder gespeicherte fremde Informationen zu überwachen oder nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen. Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon unberührt. Eine diesbezügliche Haftung ist jedoch erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung möglich. Bei Bekanntwerden entsprechender Rechtsverletzungen werde ich diese Inhalte umgehend entfernen.",
      
      "liability_links": "Haftung für Links",
      "liability_links_text": "Mein Angebot enthält Links zu externen Websites Dritter, auf deren Inhalte ich keinen Einfluss habe. Deshalb kann ich für diese fremden Inhalte auch keine Gewähr übernehmen. Für die Inhalte der verlinkten Seiten ist stets der jeweilige Anbieter oder Betreiber der Seiten verantwortlich. Die verlinkten Seiten wurden zum Zeitpunkt der Verlinkung auf mögliche Rechtsverstöße überprüft. Rechtswidrige Inhalte waren zum Zeitpunkt der Verlinkung nicht erkennbar. Eine permanente inhaltliche Kontrolle der verlinkten Seiten ist jedoch ohne konkrete Anhaltspunkte einer Rechtsverletzung nicht zumutbar. Bei Bekanntwerden von Rechtsverletzungen werde ich derartige Links umgehend entfernen.",
      
      "copyright": "Urheberrecht",
      "copyright_text": "Die durch die Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechts bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers. Downloads und Kopien dieser Seite sind nur für den privaten, nicht kommerziellen Gebrauch gestattet. Soweit die Inhalte auf dieser Seite nicht vom Betreiber erstellt wurden, werden die Urheberrechte Dritter beachtet. Insbesondere werden Inhalte Dritter als solche gekennzeichnet. Sollten Sie trotzdem auf eine Urheberrechtsverletzung aufmerksam werden, bitten wir um einen entsprechenden Hinweis. Bei Bekanntwerden von Rechtsverletzungen werde ich derartige Inhalte umgehend entfernen.",
      
      "dispute": "Streitbeilegung",
      "dispute_text": "Die Europäische Kommission stellt eine Plattform zur Online-Streitbeilegung (OS) bereit:",
      "dispute_info": "Ich bin weder bereit noch verpflichtet, an Streitbeilegungsverfahren vor einer Verbraucherschlichtungsstelle teilzunehmen."
    }
  }
